//
//  Archer.swift
//  test
//
//  Created by Аяз on 21/3/23.
//

import Foundation

//Создать класс Hero c параметрами здоровье и урон добавить функции сеттеры и геттеры к парметрам. Создать класс Boss, Magic, Archer, Tank унаследовать от Hero. Создать класс Game. В Game прописать логику игры: 3 героя должны сражаться с боссом, игра продолжается до последнего выжившего, у кого здоровье отрицательное не должен наносить урон. В Game должна быть функция startGame() которая запускает игру. В main должна быть только одна строчка: Game().startGame()

class Archer: Hero{
    
}
